'''
之前
a=input('请输入数字:') #括号内可以输入自己想要的提示词
9.5上午
理解了python的一些数据结构 元组 列表 字典 集合
元组列表与数组很相似 有着索引 切片 重复 拼接 in 等操作
不过元组与列表的差别在于前者不能更改元素 而后者可以
至于字典感觉是py最特殊且有趣的数据结构 十分方便且有用
可以由自己去确定key与value
9.5下午
虽然c已经学了函数 但是还是重温了一遍 还是有一些新东西的
老东西： 调用 形参实参 返回值
新东西 
  参数传递 --位置 关键(就是把形参名字加上) 默认值(不说默认但也可以改) 
            元组列表字典参数虽然有可变 但是好像可以直接用一个空的
  函数模块化 --import from as 等所以安装第三方库就很常见啦

类的学习 封装 继承 多态 
好像理解了 但是还需要实践
自我感觉良好 似乎python学明白了 主要是有c的基础

9.6下午
文件处理
numpy 感觉这个在鱼书上已经讲过啦 广播的性质可能比较特殊
numpy的相关运算非常多 使用的时候再搜

9.7上午
3层神经网络的实现 输出层使用的函数 分类--softmax 回归--恒等函数
分类比较好理解 就是判断数据对应的类别
回归是通过数据去预测对应的其他特征 比如通过照片预测其体重

神经网络的学习 核心目的是找到提高识别精度的最佳权重 
损失函数 梯度法 以及为什么用损失函数                            #闲话 还是在云端记录感受比较高效 打字总是比自己些快得多
'''